Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/usbhs.h
/* -------- USBHS_INTRRXE : (USBHS Offset: 0x1008) (R/W 16) Interrupt Enable Bits for INTRRX -------- */
#define USBHS_INTRRXE_RESETVALUE              _UINT16_(0xFFFE)                                     /*  (USBHS_INTRRXE) Interrupt Enable Bits for INTRRX  Reset Value */

#define USBHS_INTRRXE_EP1RXE_Pos              _UINT16_(1)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP1 Position */
#define USBHS_INTRRXE_EP1RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP1RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP1 Mask */
#define USBHS_INTRRXE_EP1RXE(value)           (USBHS_INTRRXE_EP1RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP1RXE_Pos)) /* Assigment of value for EP1RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP2RXE_Pos              _UINT16_(2)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP2 Position */
#define USBHS_INTRRXE_EP2RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP2RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP2 Mask */
#define USBHS_INTRRXE_EP2RXE(value)           (USBHS_INTRRXE_EP2RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP2RXE_Pos)) /* Assigment of value for EP2RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP3RXE_Pos              _UINT16_(3)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP3 Position */
#define USBHS_INTRRXE_EP3RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP3RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP3 Mask */
#define USBHS_INTRRXE_EP3RXE(value)           (USBHS_INTRRXE_EP3RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP3RXE_Pos)) /* Assigment of value for EP3RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP4RXE_Pos              _UINT16_(4)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP4 Position */
#define USBHS_INTRRXE_EP4RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP4RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP4 Mask */
#define USBHS_INTRRXE_EP4RXE(value)           (USBHS_INTRRXE_EP4RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP4RXE_Pos)) /* Assigment of value for EP4RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP5RXE_Pos              _UINT16_(5)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP5 Position */
#define USBHS_INTRRXE_EP5RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP5RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP5 Mask */
#define USBHS_INTRRXE_EP5RXE(value)           (USBHS_INTRRXE_EP5RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP5RXE_Pos)) /* Assigment of value for EP5RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP6RXE_Pos              _UINT16_(6)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP6 Position */
#define USBHS_INTRRXE_EP6RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP6RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP6 Mask */
#define USBHS_INTRRXE_EP6RXE(value)           (USBHS_INTRRXE_EP6RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP6RXE_Pos)) /* Assigment of value for EP6RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_EP7RXE_Pos              _UINT16_(7)                                          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP7 Position */
#define USBHS_INTRRXE_EP7RXE_Msk              (_UINT16_(0x1) << USBHS_INTRRXE_EP7RXE_Pos)          /* (USBHS_INTRRXE) Interrupt Enabled for RX EP7 Mask */
#define USBHS_INTRRXE_EP7RXE(value)           (USBHS_INTRRXE_EP7RXE_Msk & (_UINT16_(value) << USBHS_INTRRXE_EP7RXE_Pos)) /* Assigment of value for EP7RXE in the USBHS_INTRRXE register */
#define USBHS_INTRRXE_Msk                     _UINT16_(0x00FE)                                     /* (USBHS_INTRRXE) Register Mask  */


/* -------- USBHS_INTRUSB : (USBHS Offset: 0x100A) ( R/ 8) Read Only Register Which Indicates Which USB Interrupts Are Currently Active. -------- */
#define USBHS_INTRUSB_RESETVALUE              _UINT8_(0x00)                                        /*  (USBHS_INTRUSB) Read Only Register Which Indicates Which USB Interrupts Are Currently Active.  Reset Value */

#define USBHS_INTRUSB_SUSPEND_Pos             _UINT8_(0)                                           /* (USBHS_INTRUSB) Set When Suspend Signal Is Detected On The Bus Position */
#define USBHS_INTRUSB_SUSPEND_Msk             (_UINT8_(0x1) << USBHS_INTRUSB_SUSPEND_Pos)          /* (USBHS_INTRUSB) Set When Suspend Signal Is Detected On The Bus Mask */
#define USBHS_INTRUSB_SUSPEND(value)          (USBHS_INTRUSB_SUSPEND_Msk & (_UINT8_(value) << USBHS_INTRUSB_SUSPEND_Pos)) /* Assigment of value for SUSPEND in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_RESUME_Pos              _UINT8_(1)                                           /* (USBHS_INTRUSB) Set When Resume Signal Is Detected On The Bus Position */
#define USBHS_INTRUSB_RESUME_Msk              (_UINT8_(0x1) << USBHS_INTRUSB_RESUME_Pos)           /* (USBHS_INTRUSB) Set When Resume Signal Is Detected On The Bus Mask */
#define USBHS_INTRUSB_RESUME(value)           (USBHS_INTRUSB_RESUME_Msk & (_UINT8_(value) << USBHS_INTRUSB_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_RESET_Pos               _UINT8_(2)                                           /* (USBHS_INTRUSB) Set In Peripheral Mode when Reset Is Detected On The Bus. In HostMode When Babble Is Detected Position */
#define USBHS_INTRUSB_RESET_Msk               (_UINT8_(0x1) << USBHS_INTRUSB_RESET_Pos)            /* (USBHS_INTRUSB) Set In Peripheral Mode when Reset Is Detected On The Bus. In HostMode When Babble Is Detected Mask */
#define USBHS_INTRUSB_RESET(value)            (USBHS_INTRUSB_RESET_Msk & (_UINT8_(value) << USBHS_INTRUSB_RESET_Pos)) /* Assigment of value for RESET in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_SOF_Pos                 _UINT8_(3)                                           /* (USBHS_INTRUSB) Set When A New Frame Starts Position */
#define USBHS_INTRUSB_SOF_Msk                 (_UINT8_(0x1) << USBHS_INTRUSB_SOF_Pos)              /* (USBHS_INTRUSB) Set When A New Frame Starts Mask */
#define USBHS_INTRUSB_SOF(value)              (USBHS_INTRUSB_SOF_Msk & (_UINT8_(value) << USBHS_INTRUSB_SOF_Pos)) /* Assigment of value for SOF in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_CONN_Pos                _UINT8_(4)                                           /* (USBHS_INTRUSB) Set When A Device Connection Is Detected Position */
#define USBHS_INTRUSB_CONN_Msk                (_UINT8_(0x1) << USBHS_INTRUSB_CONN_Pos)             /* (USBHS_INTRUSB) Set When A Device Connection Is Detected Mask */
#define USBHS_INTRUSB_CONN(value)             (USBHS_INTRUSB_CONN_Msk & (_UINT8_(value) << USBHS_INTRUSB_CONN_Pos)) /* Assigment of value for CONN in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_DISCON_Pos              _UINT8_(5)                                           /* (USBHS_INTRUSB) Set In Host Mode When A Device Disconnect Is Detected.Set In Peripheral Mode When A Session Ends Position */
#define USBHS_INTRUSB_DISCON_Msk              (_UINT8_(0x1) << USBHS_INTRUSB_DISCON_Pos)           /* (USBHS_INTRUSB) Set In Host Mode When A Device Disconnect Is Detected.Set In Peripheral Mode When A Session Ends Mask */
#define USBHS_INTRUSB_DISCON(value)           (USBHS_INTRUSB_DISCON_Msk & (_UINT8_(value) << USBHS_INTRUSB_DISCON_Pos)) /* Assigment of value for DISCON in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_SESSREQ_Pos             _UINT8_(6)                                           /* (USBHS_INTRUSB) Set When Session Request Signaling Has Been Detected. Position */
#define USBHS_INTRUSB_SESSREQ_Msk             (_UINT8_(0x1) << USBHS_INTRUSB_SESSREQ_Pos)          /* (USBHS_INTRUSB) Set When Session Request Signaling Has Been Detected. Mask */
#define USBHS_INTRUSB_SESSREQ(value)          (USBHS_INTRUSB_SESSREQ_Msk & (_UINT8_(value) << USBHS_INTRUSB_SESSREQ_Pos)) /* Assigment of value for SESSREQ in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_VBUSERR_Pos             _UINT8_(7)                                           /* (USBHS_INTRUSB) Set When VBus Drops Below The VBus Valid Threshold During A Session. Position */
#define USBHS_INTRUSB_VBUSERR_Msk             (_UINT8_(0x1) << USBHS_INTRUSB_VBUSERR_Pos)          /* (USBHS_INTRUSB) Set When VBus Drops Below The VBus Valid Threshold During A Session. Mask */
#define USBHS_INTRUSB_VBUSERR(value)          (USBHS_INTRUSB_VBUSERR_Msk & (_UINT8_(value) << USBHS_INTRUSB_VBUSERR_Pos)) /* Assigment of value for VBUSERR in the USBHS_INTRUSB register */
#define USBHS_INTRUSB_Msk                     _UINT8_(0xFF)                                        /* (USBHS_INTRUSB) Register Mask  */


/* -------- USBHS_INTRUSBE : (USBHS Offset: 0x100B) (R/W 8) Interrupt Enable Bits for USB Interrupts -------- */
#define USBHS_INTRUSBE_RESETVALUE             _UINT8_(0x06)                                        /*  (USBHS_INTRUSBE) Interrupt Enable Bits for USB Interrupts  Reset Value */

