Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/usbhs.h
/* -------- USBHS_ENDPOINTX_TXMAXP : (USBHS Offset: 0x1010) (R/W 16) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected TX Endpoint In A Single Operation -------- */
#define USBHS_ENDPOINTX_TXMAXP_RESETVALUE     _UINT16_(0x00)                                       /*  (USBHS_ENDPOINTX_TXMAXP) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected TX Endpoint In A Single Operation  Reset Value */

#define USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Pos _UINT16_(0)                                          /* (USBHS_ENDPOINTX_TXMAXP) Maximum Payload/Transactions Position */
#define USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Msk (_UINT16_(0x7FF) << USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Pos) /* (USBHS_ENDPOINTX_TXMAXP) Maximum Payload/Transactions Mask */
#define USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD(value) (USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_TXMAXP_MAXPAYLOAD_Pos)) /* Assigment of value for MAXPAYLOAD in the USBHS_ENDPOINTX_TXMAXP register */
#define USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Pos _UINT16_(11)                                         /* (USBHS_ENDPOINTX_TXMAXP) Multiplier Value (m-1) Position */
#define USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Msk (_UINT16_(0x1F) << USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Pos) /* (USBHS_ENDPOINTX_TXMAXP) Multiplier Value (m-1) Mask */
#define USBHS_ENDPOINTX_TXMAXP_MULTIPLIER(value) (USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_TXMAXP_MULTIPLIER_Pos)) /* Assigment of value for MULTIPLIER in the USBHS_ENDPOINTX_TXMAXP register */
#define USBHS_ENDPOINTX_TXMAXP_Msk            _UINT16_(0xFFFF)                                     /* (USBHS_ENDPOINTX_TXMAXP) Register Mask  */


/* -------- USBHS_ENDPOINTX_TXCSRL : (USBHS Offset: 0x1012) (R/W 8) ENDPOINTX Control And Status Bits for TX Endpoints 1-15 -------- */
#define USBHS_ENDPOINTX_TXCSRL_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_TXCSRL) ENDPOINTX Control And Status Bits for TX Endpoints 1-15  Reset Value */

#define USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Pos   _UINT8_(0)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Sets This Bit After Loading A Data Packet Into The FIFO. Position */
#define USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Msk   (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Sets This Bit After Loading A Data Packet Into The FIFO. Mask */
#define USBHS_ENDPOINTX_TXCSRL_TXPKTRDY(value) (USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_TXPKTRDY_Pos)) /* Assigment of value for TXPKTRDY in the USBHS_ENDPOINTX_TXCSRL register */
#define USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_TXCSRL) The USB Sets This Bit When There Is At Least 1 Packet In The TX FIFO. Position */
#define USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The USB Sets This Bit When There Is At Least 1 Packet In The TX FIFO. Mask */
#define USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY(value) (USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_FIFONOTEMPTY_Pos)) /* Assigment of value for FIFONOTEMPTY in the USBHS_ENDPOINTX_TXCSRL register */
#define USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Pos  _UINT8_(3)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Flush The Latest Packet From The Endpoint TX FIFO Position */
#define USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Msk  (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Flush The Latest Packet From The Endpoint TX FIFO Mask */
#define USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO(value) (USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_FLUSHFIFO_Pos)) /* Assigment of value for FLUSHFIFO in the USBHS_ENDPOINTX_TXCSRL register */
#define USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0. Position */
#define USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0. Mask */
#define USBHS_ENDPOINTX_TXCSRL_CLRDATATOG(value) (USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_CLRDATATOG_Pos)) /* Assigment of value for CLRDATATOG in the USBHS_ENDPOINTX_TXCSRL register */
#define USBHS_ENDPOINTX_TXCSRL_Msk            _UINT8_(0x4B)                                        /* (USBHS_ENDPOINTX_TXCSRL) Register Mask  */

/* HOST_EPX mode */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_TXCSRL) This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral Position */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Pos) /* (USBHS_ENDPOINTX_TXCSRL) This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral Mask */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR(value) (USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_ERROR_Pos))
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction Position */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction Mask */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT(value) (USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_SETUPPKT_Pos))
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_TXCSRL) This Bit Is Set When A Stall Handshake Is Received. Position */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Pos) /* (USBHS_ENDPOINTX_TXCSRL) This Bit Is Set When A Stall Handshake Is Received. Mask */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL(value) (USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_RXSTALL_Pos))
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_TXCSRL) This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register. Position */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Pos) /* (USBHS_ENDPOINTX_TXCSRL) This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register. Mask */
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT(value) (USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_HOST_EPX_NAKTIMEOUT_Pos))
#define USBHS_ENDPOINTX_TXCSRL_HOST_EPX_Msk   _UINT8_(0xB4)                                         /* (USBHS_ENDPOINTX_TXCSRL_HOST_EPX) Register Mask  */

/* PERIPHERAL_EPX mode */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_TXCSRL) The USB Sets This Bit If An In Token Is Received When TxPktRdy Is Not Set. Position */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The USB Sets This Bit If An In Token Is Received When TxPktRdy Is Not Set. Mask */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN(value) (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_UNDERRUN_Pos))
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Issue A Stall Handshake To An In Token Position */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos) /* (USBHS_ENDPOINTX_TXCSRL) The CPU Writes A 1 To This Bit To Issue A Stall Handshake To An In Token Mask */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL(value) (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos))
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_TXCSRL) This Bit Is Set When A Stall Handshake Is Transmitted. Position */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos) /* (USBHS_ENDPOINTX_TXCSRL) This Bit Is Set When A Stall Handshake Is Transmitted. Mask */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL(value) (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos))
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_TXCSRL) When The Endpoint Is Being Used For High-Bandwidth Isochronous, This Bit Is Set To Indicate Where A Large Packet Has Been Split Into 2 Or 3 Packets For Transmission But Insufficient IN Tokens Have Been Received To Send All The Parts. Position */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Pos) /* (USBHS_ENDPOINTX_TXCSRL) When The Endpoint Is Being Used For High-Bandwidth Isochronous, This Bit Is Set To Indicate Where A Large Packet Has Been Split Into 2 Or 3 Packets For Transmission But Insufficient IN Tokens Have Been Received To Send All The Parts. Mask */
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX(value) (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_INCOMPTX_Pos))
#define USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX_Msk _UINT8_(0xB4)                                         /* (USBHS_ENDPOINTX_TXCSRL_PERIPHERAL_EPX) Register Mask  */


/* -------- USBHS_ENDPOINT0_CSR0L : (USBHS Offset: 0x1012) (R/W 8) ENDPOINT0 Control And Status Bits for TX Endpoint 0 -------- */
#define USBHS_ENDPOINT0_CSR0L_RESETVALUE      _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_CSR0L) ENDPOINT0 Control And Status Bits for TX Endpoint 0  Reset Value */

#define USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Pos    _UINT8_(0)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Data Packet Has Been Received Position */
#define USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Msk    (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Data Packet Has Been Received Mask */
#define USBHS_ENDPOINT0_CSR0L_RXPKTRDY(value) (USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_RXPKTRDY_Pos)) /* Assigment of value for RXPKTRDY in the USBHS_ENDPOINT0_CSR0L register */
#define USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Pos    _UINT8_(1)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit After Loading A Data Packet Into The FIFO. Position */
#define USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Msk    (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit After Loading A Data Packet Into The FIFO. Mask */
#define USBHS_ENDPOINT0_CSR0L_TXPKTRDY(value) (USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_TXPKTRDY_Pos)) /* Assigment of value for TXPKTRDY in the USBHS_ENDPOINT0_CSR0L register */
#define USBHS_ENDPOINT0_CSR0L_Msk             _UINT8_(0x03)                                        /* (USBHS_ENDPOINT0_CSR0L) Register Mask  */

/* HOST_EP0 mode */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Stall Handshake Is Received. Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Stall Handshake Is Received. Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_RXSTALL_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_SETUPPKT_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_ERROR_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit To Request An IN Transaction Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit To Request An IN Transaction Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_REQPKT_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit At The Same Time As The TxPktRdy Or ReqPkt Bit Is Set, To Perform A Status Stage Transaction Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit At The Same Time As The TxPktRdy Or ReqPkt Bit Is Set, To Perform A Status Stage Transaction Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_STATUSPKT_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register. Position */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register. Mask */
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT(value) (USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_HOST_EP0_NAKTIMEOUT_Pos))
#define USBHS_ENDPOINT0_CSR0L_HOST_EP0_Msk    _UINT8_(0xFC)                                         /* (USBHS_ENDPOINT0_CSR0L_HOST_EP0) Register Mask  */

/* PERIPHERAL_EP0 mode */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Stall Handshake Is Transmitted. Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Is Set When A Stall Handshake Is Transmitted. Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENTSTALL_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit 1. When Setting TxPktRdy For The Last Data Packet 2. When Clearing RxPktRdy After Unloading The Last Data Packet.3. When Setting TxPktRdy For A Zero Length Data Packet. Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Sets This Bit 1. When Setting TxPktRdy For The Last Data Packet 2. When Clearing RxPktRdy After Unloading The Last Data Packet.3. When Setting TxPktRdy For A Zero Length Data Packet. Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_DATAEND_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When A Control Transaction Ends Before The DataEnd Bit Has Been Set Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Pos) /* (USBHS_ENDPOINT0_CSR0L) This Bit Will Be Set When A Control Transaction Ends Before The DataEnd Bit Has Been Set Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SETUPEND_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Terminate The Current Transaction Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Terminate The Current Transaction Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SENDSTALL_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Clear The RxPktRdy Bit. It Is Cleared Automatically Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Clear The RxPktRdy Bit. It Is Cleared Automatically Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDRXPKTRDY_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Clear The SetupEnd Bit. It Is Cleared Automatically. Position */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Pos) /* (USBHS_ENDPOINT0_CSR0L) The CPU Writes A 1 To This Bit To Clear The SetupEnd Bit. It Is Cleared Automatically. Mask */
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND(value) (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_SERVICEDSETUPEND_Pos))
#define USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0_Msk _UINT8_(0xFC)                                         /* (USBHS_ENDPOINT0_CSR0L_PERIPHERAL_EP0) Register Mask  */


/* -------- USBHS_ENDPOINTX_TXCSRH : (USBHS Offset: 0x1013) (R/W 8) ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15 -------- */
#define USBHS_ENDPOINTX_TXCSRH_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_TXCSRH) ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15  Reset Value */

#define USBHS_ENDPOINTX_TXCSRH_MODE_Pos       _UINT8_(5)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The Endpoint Direction As TX Position */
#define USBHS_ENDPOINTX_TXCSRH_MODE_Msk       (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_MODE_Pos)    /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The Endpoint Direction As TX Mask */
#define USBHS_ENDPOINTX_TXCSRH_MODE(value)    (USBHS_ENDPOINTX_TXCSRH_MODE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_MODE_Pos)) /* Assigment of value for MODE in the USBHS_ENDPOINTX_TXCSRH register */
#define USBHS_ENDPOINTX_TXCSRH_Msk            _UINT8_(0x20)                                        /* (USBHS_ENDPOINTX_TXCSRH) Register Mask  */

